Revit 2024 API
ShapeImporter.SetDefaultLengthUnit Method
 Sets the length unit to be used when the input is a unitless SAT file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017_subscription_update
Syntax
C#
public ShapeImporter SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
Visual Basic
Public Function SetDefaultLengthUnit ( _
	defaultLengthUnit As ImportUnit _
) As ShapeImporter
Visual C++
public:
ShapeImporter^ SetDefaultLengthUnit(
	ImportUnit defaultLengthUnit
)
Parameters
defaultLengthUnit
Type: Autodesk.Revit.DB.ImportUnit
 The length unit to be used for when the input is a unitless SAT file.
Remarks
 Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace